app/controllers/accounts_controller.rb

  def create_account
    #取出哈希param中的name、email等元素
    name = params[:account][:name]
    email = params[:account][:email]
    password = params[:account][:password]
    password_confirmation = params[:account][:password_confirmation]
    role = params[:account][:role]
    status = 0
    if role.to_i == 1
      status = 1
    end
    #从账户表中查找是否有相同的email，有相同的email说明该邮箱已经被注册过了
    account = Account.find_by(email:email)
---
SELECT `accounts`.* FROM `accounts` WHERE `accounts`.`email` = 'foobar@123.com' LIMIT 1

      @account.password = password
      @account.role = role
      #.save保存成功时，返回true，失败时返回false
      boolean = @account.save
---
INSERT INTO `accounts` (`name`, `email`, `password`, `role`, `status`, `created_at`, `updated_at`, `auth_token`) VALUES ('john', 'foobar@123.com', '123', 0, 0, '2020-05-21 23:56:17.361817', '2020-05-21 23:56:17.361817', 'xS-BFn1ZS1_TESa9EkDuRQ')

  def create_login
    #从params中取email、password的值
    #strip是去除字符串头部和尾部的空格的方法
    email = params[:email].strip
    password = params[:password]
    #通过email查找用户
    account = Account.find_by(email:email)
---
SELECT `accounts`.* FROM `accounts` WHERE `accounts`.`email` = 'foobar@123.com' LIMIT 1