app/controllers/accounts_controller.rb

  def account_active
    #查出所有管理员账号
    @accounts = Account.where(role:1)
---
SELECT `accounts`.* FROM `accounts` WHERE `accounts`.`role` = 1

  def update_active
    #取出params哈希中的account_id参数
    account_id = params[:account_id]
    #查找出account_id对应的Account对象
    account = Account.find(account_id)
    #将状态修改成已激活
    account.status = 0
    account.save
---
SELECT `accounts`.* FROM `accounts` WHERE `accounts`.`id` = 3 LIMIT 1
UPDATE `accounts` SET `accounts`.`status` = 0, `accounts`.`updated_at` = '2020-05-22 04:42:00.846750' WHERE `accounts`.`id` = 3

  def create_account
    #取出哈希param中的name、email等元素
    name = params[:account][:name]
    email = params[:account][:email]
    password = params[:account][:password]
    password_confirmation = params[:account][:password_confirmation]
    role = params[:account][:role]
    status = 0
    if role.to_i == 1
      status = 1
    end
    #从账户表中查找是否有相同的email，有相同的email说明该邮箱已经被注册过了
    account = Account.find_by(email:email)
    #创建一个Account类的对象
    @account = Account.new
    #先判断name、email是否为空
    if name.blank? || email.blank?
      flash.notice = "username or email can't be blank"
      render :signup
      #判断account是否存在，即是否存在相同邮箱的用户
    elsif account
      flash.notice = "email is already registered"
      render :signup
      #判断名字的长度是否大于10
    elsif name.length > 10
---
SELECT `accounts`.* FROM `accounts` WHERE `accounts`.`email` = '222@222.com' LIMIT 1
SELECT `accounts`.* FROM `accounts` WHERE `accounts`.`email` = 'foobar@123.com' LIMIT 1

      @account.password = password
      @account.role = role
      #.save保存成功时，返回true，失败时返回false
      boolean = @account.save
---
INSERT INTO `accounts` (`name`, `email`, `password`, `role`, `status`, `created_at`, `updated_at`, `auth_token`) VALUES ('jake', '222@222.com', '111', 1, 1, '2020-05-22 04:39:53.438347', '2020-05-22 04:39:53.438347', 'dUBrZah_xYD5BlUI-xWKPA')

  def create_login
    #从params中取email、password的值
    #strip是去除字符串头部和尾部的空格的方法
    email = params[:email].strip
    password = params[:password]
    #通过email查找用户
    account = Account.find_by(email:email)
---
SELECT `accounts`.* FROM `accounts` WHERE `accounts`.`email` = '222@222.com' LIMIT 1