app/controllers/application_controller.rb

  def check_login
    # @current_user ||= session[:account_id] && Account.find(session[:account_id])
    @current_user ||= cookies[:auth_token] && Account.find_by(auth_token:cookies[:auth_token])
---
SELECT `accounts`.* FROM `accounts` WHERE `accounts`.`auth_token` = 'xS-BFn1ZS1_TESa9EkDuRQ' LIMIT 1