app/controllers/home_controller.rb

  def index
    @posts = Post.where(status:0).order(as_type: :desc,updated_at: :desc)
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`status` = 0 ORDER BY `posts`.`as_type` DESC, `posts`.`updated_at` DESC