app/controllers/posts_controller.rb

INSERT INTO `posts` (`head`, `body`, `account_id`, `as_type`, `status`, `created_at`, `updated_at`) VALUES ('first post', 'first post should be no less than eight', 4, 0, 0, '2020-05-22 04:50:37.891097', '2020-05-22 04:50:37.891097')
---
  def create
    head = params[:post][:head]
    body = params[:post][:body].strip
    if head.blank?
      flash.notice = "Empty head not allowed"
    elsif body.length < 8
      flash.notice = "length is less than 8"
    else
      post = Post.new(account_id: @current_user.id,as_type:0,status:0)
      post.head = head
      post.body = body
      boolean = post.save