app/models/account.rb

  def generate_token
    auth_token = nil
    begin
      auth_token = SecureRandom.urlsafe_base64
      Rails.logger.info "===auth_token==========#{auth_token}"
    end while Account.exists?(auth_token:"#{auth_token}")
---
SELECT 1 AS one FROM `accounts` WHERE `accounts`.`auth_token` = 'xS-BFn1ZS1_TESa9EkDuRQ' LIMIT 1