app/models/post.rb

SELECT `accounts`.* FROM `accounts` WHERE `accounts`.`id` = 4 LIMIT 1
---
  def get_account_name
    #self代表实例本身，即Post.first这个实例对象
    account_id = self.account_id
    account = Account.find_by(id:account_id)